package com.cold.controller;

/**
 * 数据的类型分类
 *、
 * 1.基本数据类型
 * 2.引用数据类型 （ 类 接口  数组）
 *
 * 基本数据类型 有4类 8种
 *
 * 1.整数                     占用字节     取值范围
 *          byte                1         128 ~ 127
 *          short               2         -32768 ~ 32767
 *          int                 4         -2147483648 ~ 2147483647
 *          long                8         -9223372036854774808 ~ 9223372036854774807
 *2.浮点类型
 *         float                4
 *         double               8
 *3.字符
 *          char                2
 *4.布尔
 *          booleon             1
 *
 *
 * 注意：整数类型默认是int 浮点类型默认是double
 * 定义long类型的时候 我们要加L 或者l  更建议使用L
 * 定义float 类型数据的时候 我们要加F或者f  也是更建议使用F
 *
 *
 *
 *
 *
 *
 */

public class DateType {
}
